Repository: WordPressBugBounty/plugins-hide-cart-functions
Catalog: hide-cart-functions/languages/hide-cart-functions-*.po
Languages: fi_fi

source: Search Product
fi_fi: Hae tuotetta

source: Select category
fi_fi: Valitse kategoria

source: No results found.
fi_fi: Ei tuloksia.

source: Hide Functions
fi_fi: Piilota toiminnot

source: Settings
fi_fi: Asetukset

source: Donation for Homeless
fi_fi: Lahjoitus kodittomille

source: More information about %s
fi_fi: Lisätietoja: %s

source: View Details
fi_fi: Näytä tiedot

source: Number of items per page
fi_fi: Kohteiden määrä sivulla

source: Hide Cart Functions
fi_fi: Piilota ostoskorin toiminnot

source: Add New
fi_fi: Lisää uusi

source: Search results for %s
fi_fi: Hakutulokset: %s

source: Search Result
fi_fi: Hakutulos

source: Manage Settings
fi_fi: Hallitse asetuksia

source: Saved Settings
fi_fi: Tallennetut

source: Edit Settings
fi_fi: Muokkaa asetuksia

source: Existing Rule
fi_fi: Olemassa oleva sääntö

source: Add New Settings
fi_fi: Lisää uudet asetukset

source: Disable Settings
fi_fi: Poista asetukset käytöstä

source: Check this option to disable this rule. Leave unchecked to apply the selected settings.
fi_fi: Valitse poistaaksesi säännön käytöstä. Jätä tyhjäksi ottaaksesi käyttöön.

source: Rule enabled
fi_fi: Sääntö käytössä

source: Guests Only
fi_fi: Vain vieraat

source: Logged in Users --> Leave both unchecked for ALL users.
fi_fi: Kirjautuneet käyttäjät --> Jätä molemmat tyhjäksi KAIKILLE.

source: Rule Title
fi_fi: Säännön otsikko

source: Create short title for rule for display in the settings table.
fi_fi: Luo lyhyt otsikko näytettäväksi asetustaulukossa.

source: Hide Quantity
fi_fi: Piilota määrä

source: Check this option to hide the default cart "Quantity" product function.
fi_fi: Valitse piilottaaksesi oletusarvoisen "Määrä"-toiminnon.

source: Hide Add to Cart
fi_fi: Piilota Lisää koriin

source: Check this option to hide the default cart "Add to Cart" button.
fi_fi: Valitse piilottaaksesi oletusarvoisen "Lisää koriin" -painikkeen.

source: Hide Price
fi_fi: Piilota hinta

source: Check this option to hide the default cart "Price" displayed.
fi_fi: Valitse piilottaaksesi oletusarvoisen "Hinta"-näytön.

source: Override Price Tag
fi_fi: Korvaa hintatunniste

source: This text will override the price tag. Use the %s to keep showing price in the tag with other text.
fi_fi: Tämä teksti korvaa hintatunnisteen. Käytä %s näyttääksesi hinnan muun tekstin kanssa.

source: Hide Options
fi_fi: Piilota vaihtoehdot

source: Check this option to hide the default cart "Options" dropdown selector.
fi_fi: Valitse piilottaaksesi oletusarvoisen "Vaihtoehdot"-pudotusvalikon.

source: Hide Custom Element
fi_fi: Piilota mukautettu elementti

source: Enter specific IDs or classes to hide a custom element.
fi_fi: Syötä ID:t tai luokat piilottaaksesi elementin.

source: Separate multiple values by comma (examples: .custom-item-one, .custom-item-two, #new-item-id).
fi_fi: Erota arvot pilkuilla (esim: .kohde-yksi, .kohde-kaksi, #uusi-id).

source: Custom Message
fi_fi: Mukautettu viesti

source: Enter a custom message to be added above or below the "Short product description"
fi_fi: Syötä viesti lisättäväksi "Lyhyen tuotekuvauksen" ylä- tai alapuolelle

source: Custom Message Position
fi_fi: Viestin sijainti

source: Above Short product description
fi_fi: Lyhyen tuotekuvauksen yläpuolella

source: Below Short product description.
fi_fi: Lyhyen tuotekuvauksen alapuolella.

source: Select position where Custom Message should be inserted.
fi_fi: Valitse mukautetun viestin sijainti.

source: Selected Category
fi_fi: Valittu kategoria

source: Some browsers, hold the "Ctrl" key while clicking to select multiple or to deselect entirely.
fi_fi: Joissakin selaimissa pidä "Ctrl" pohjassa valitaksesi useita tai poistaaksesi valinnan.

source: Product IDs
fi_fi: Tuote-ID:t

source: Separate multiple values by comma (3443, 5567, 3456) or leave empty to apply this rule to all products.
fi_fi: Erota arvot pilkuilla (3443, 5567, 3456) tai jätä tyhjäksi kaikille tuotteille.

source: Search Products
fi_fi: Hae tuotteita

source: Search and select products with 3 letter minimum. Works in combination with the Product ID field.
fi_fi: Hae ja valitse tuotteita (vähintään 3 kirjainta). Toimii Tuote-ID-kentän kanssa.

source: Save Settings
fi_fi: Tallenna asetukset

source: Add Settings
fi_fi: Lisää asetukset

source: Title
fi_fi: Otsikko

source: Status
fi_fi: Tila

source: Quantity
fi_fi: Määrä

source: Add to Cart
fi_fi: Lisää koriin

source: Price
fi_fi: Hinta

source: Options
fi_fi: Vaihtoehdot

source: No Item available.
fi_fi: Ei kohteita saatavilla.

source: Edit
fi_fi: Muokkaa

source: Delete
fi_fi: Poista

source: Disabled
fi_fi: Pois käytöstä

source: Enabled
fi_fi: Käytössä

source: Delete all database entries if the plugin is deactivated?
fi_fi: Poista kaikki tietokantatiedot kun lisäosa poistetaan käytöstä?

source: Settings Updated Successfully.
fi_fi: Asetukset päivitetty onnistuneesti.

source: Settings Successfully Deleted.
fi_fi: Asetukset poistettu onnistuneesti.

source: Success!
fi_fi: Onnistui!

source: Settings saved.
fi_fi: Asetukset tallennettu.

source: Store-Wide Settings
fi_fi: Kaupan laajuiset asetukset

source: Cripple Bots
fi_fi: Estä botit

source: Require a valid cart session before checkout.
fi_fi: Vaadi voimassa oleva ostoskori-istunto ennen kassalle siirtymistä.

source: Blocks direct POST attacks by card test bots. Real customers continue to add products to their cart through normal browsing. Orders without a valid session are rejected before reaching the payment gateway.
fi_fi: Estää korttitestausbottien suorat POST-hyökkäykset. Oikeat asiakkaat jatkavat tuotteiden lisäämistä ostoskoriinsa normaalin selauksen kautta. Tilaukset ilman voimassa olevaa istuntoa hylätään ennen maksuportaaliin pääsyä.

source: Disable Purchases
fi_fi: Poista ostokset käytöstä

source: Check this option to completely block code-activated purchases.
fi_fi: Valitse tämä vaihtoehto estääksesi koodiaktivoidut ostokset kokonaan.

source: Completely prevents cart bots from placing orders via direct POST requests, as well as customers. Best used temporarily as a nuclear option.
fi_fi: Estää kokonaan ostoskoribotteja ja asiakkaita tekemästä tilauksia suorilla POST-pyynnöillä. Parasta käyttää väliaikaisesti ydinvaihtoehtona.

source: Delete Data on Uninstall
fi_fi: Poista tiedot poistettaessa

source: WARNING:
fi_fi: VAROITUS:

source: All plugin settings will be permanently deleted if this plugin is uninstalled.
fi_fi: Kaikki lisäosan asetukset poistetaan pysyvästi, jos tämä lisäosa poistetaan.

source: Support
fi_fi: Tuki

source: Leave Review
fi_fi: Jätä arvostelu

source: This plugin is free, but your donation aids orphans:
fi_fi: Tämä lisäosa on ilmainen, mutta lahjoituksesi auttaa orpoja:

source: I Want to Help
fi_fi: Haluan auttaa

source: Deleted!
fi_fi: Poistettu!

source: Settings deleted.
fi_fi: Asetukset poistettu.

source: Function Rule
fi_fi: Toimintosääntö
